package summary.test;

public class Summary1 {
    /**
     * @Todo 以后自己可以多做一些安全测试 私下里 工作上先把本职业务测试加开发做好 私下学习一些安全测试 移动端安全等 可以自己挖源码漏洞啊 没有代码不是有现成的JAVA源码吗
     *
     * 功能测试
     * 输入框：特殊字符、超长字符、负值、0 null、很大的值 小数
     * 特别大的数值可能会导致溢出
     *
     *
     * 逻辑测试：每个功能走一遍
     * 功能测试 每个功能走一遍 查看流程、逻辑是否混乱 有没有功能遗漏
     * 界面测试：图标、排版等
     * 兼容性测试：不同平台、机型、系统 是否有闪退
     * 漏洞检测：从应用安全、代码、数据安全角度，用户管理、界面劫持、动态调试、进程保护、数据传输、业务逻辑安全、
     * 系统安全、数据存储、程序完整性等角度
     * 压力测试 ：检测是否卡顿、加载缓慢
     * 中断测试：强制关闭、断电、断网、突然来电话、等情况下是不是正常运行
     * 弱网测试 在网络情况比较差的情况下测试（QNET）
     *
     *
     * 测试不仅考虑不同的端 web端浏览器
     * 还要考虑安卓的版本 浏览器内核的版本
     */
}
