package summary.ky;

public class Summary1 {
    /**
     * 2月找工作了 已经三月底了还是无
     *
     * 数学基础太差
     * 3月份开始多花时间在数学上
     * 争取六月份把基础看完
     * 七八月宇哥强化+1000题重点
     * （数学不能总看视频 要多写多练 本来数二的计算量就很大）
     * 基础搞完就是多刷题了 一定得多写多练
     *
     * 前期每天要保证英语单词
     * 后期刷英语真题可能涉及到语法问题 可以提前学了 因为之前英语还可以并且可以把时间都放在别的重点科目上
     * 八月末开始大小作文（一对一老师）
     *
     * 408的安排 别人是到8月份结束一轮408
     * 跟数学安排的时间和接近 其实我是本专业的话 计算机网络和数据结构都有接触过 时间可以少点
     * 重点是计算机组成和操作系统 后期上班了 每天坚持学几章 计网（湖科大教书匠）
     * 争取六月份结束一轮
     * 七八月强化
     * 后面就是刷题
     *
     * 政治
     * 9月左右开始 把它当作放松
     *
     * 我这边主要是边上班边准备考研
     * 所以我主要时间其实是3-6时间富裕（但是3-5都在准备面试）
     * 所以一定要抓住这个时间 不能浪费掉了
     * 3-6
     * 英语、数学基础、计组+操作系统+计网+数据结构
     * 6-8
     * 英语作文+单词、数学刷题、408强化
     * 8-12
     * 政治开始、408刷题、英语真题、数学真题
     *
     *
     * 还有编译原理
     *
     *
     */
}
